# <center>Day 6</center>

## Pandas

### Series

In [1]:
import pandas as pd

In [2]:
mylist = list(range(111,445,100))
mylist

[111, 211, 311, 411]

In [4]:
ps1 = pd.Series(data = mylist, index= ['maths', 'science', 'physics', 'english'])
ps1

maths      111
science    211
physics    311
english    411
dtype: int64

In [5]:
ps1[0]

111

In [8]:
print(ps1['maths'], type(ps1['maths']))

111 <class 'numpy.int64'>

In [10]:
print(ps1['maths'], type(ps1[['maths']]))

111 <class 'pandas.core.series.Series'>

In [11]:
ps1.count()

4

In [17]:
ps1, type(ps1)

(maths      111
 science    211
 physics    311
 english    411
 dtype: int64, pandas.core.series.Series)

In [31]:
print(ps1.count())
print(ps1[[True, False]*2])

4
maths      111
physics    311
dtype: int64

In [36]:
ps2 = pd.Series(data=[i**2 for i in range(1,11)], index="A B C D E F G H I J".split())
ps2

A      1
B      4
C      9
D     16
E     25
F     36
G     49
H     64
I     81
J    100
dtype: int64

In [37]:
ps2.index

Index(['A', 'B', 'C', 'D', 'E', 'F', 'G', 'H', 'I', 'J'], dtype='object')

In [40]:
ps2.values

array([  1,   4,   9,  16,  25,  36,  49,  64,  81, 100], dtype=int64)

In [42]:
di = {k:v for k,v in zip("Tata Birla Baja".split(), [1000, 2000, 3000])}
print(di)
pd.Series(di)

{'Tata': 1000, 'Birla': 2000, 'Baja': 3000}

Tata     1000
Birla    2000
Baja     3000
dtype: int64

### DataFrame

In [266]:
di1 = {k:[j for j in range(100*i, 100*i + 10)] for i,k in enumerate(di)}

In [267]:
di

{'Tata': 1000, 'Birla': 2000, 'Baja': 3000}

In [268]:
df1 = pd.DataFrame(di1, index="Infra Energy Auto Medical Finance FMCG Petrol Electricity Defence Others".split())
df1

             Tata  Birla  Baja
Infra           0    100   200
Energy          1    101   201
Auto            2    102   202
Medical         3    103   203
Finance         4    104   204
FMCG            5    105   205
Petrol          6    106   206
Electricity     7    107   207
Defence         8    108   208
Others          9    109   209

In [273]:
# row 1 and row 2
# column 0 and column 2
df1.iloc[[1,2],[0,2]]

201

In [63]:
d3 = {
    "Tech1": [131, 192, 125, 100, 133, 166, 192, 158, 174],
    "Infra1": [163, 117, 139, 174, 181, 105, 121, 163, 133],
    "Energy1": [105, 172, 115, 176, 150, 195, 165, 108, 109],
    "Group": ["G5","G5","G10", "G5", "G20", "G5", "G5", "G10", "G20" ],
    "Defense1": [176, 23, 434, 123, 42, 123, 123,5345, 434]
}
df2 = pd.DataFrame(d3, index=['Tata1', 'Reliance1', 'Wipro1', 'Birla1', 'Adani1', 'Brit1', 'Univ1', 'Mahindra1', 'MArico1'])

In [69]:
df2

           Tech1  Infra1  Energy1 Group  Defense1
Tata1        131     163      105    G5       176
Reliance1    192     117      172    G5        23
Wipro1       125     139      115   G10       434
Birla1       100     174      176    G5       123
Adani1       133     181      150   G20        42
Brit1        166     105      195    G5       123
Univ1        192     121      165    G5       123
Mahindra1    158     163      108   G10      5345
MArico1      174     133      109   G20       434

In [75]:
type(df2[['Tech1']])

pandas.core.frame.DataFrame

In [76]:
from os import listdir

print(listdir())

['.ipynb_checkpoints', 'Day6.ipynb', 'profit.csv']

In [80]:
d4 = pd.read_csv('profit.csv')

In [82]:
d4.info()

<class 'pandas.core.frame.DataFrame'>
Index: 9 entries, Tata1 to Marico1
Data columns (total 5 columns):
Tech1       9 non-null int64
Infra1      9 non-null int64
Energy1     9 non-null int64
Group       9 non-null object
Defense1    9 non-null int64
dtypes: int64(4), object(1)
memory usage: 360.0+ bytes

In [81]:
d4.describe()

            Tech1      Infra1     Energy1    Defense1
count    9.000000    9.000000    9.000000    9.000000
mean   152.333333  144.000000  144.111111  143.666667
std     31.917863   27.193749   35.151260   24.279621
min    100.000000  105.000000  105.000000  115.000000
25%    131.000000  121.000000  109.000000  130.000000
50%    158.000000  139.000000  150.000000  137.000000
75%    174.000000  163.000000  174.000000  154.000000
max    192.000000  181.000000  195.000000  193.000000

In [83]:
df4.count()

Tech1       9
Infra1      9
Energy1     9
Group       9
Defense1    9
dtype: int64

**Frequency of each category in a column**

In [87]:
df4['Group'].value_counts()

G5     5
G20    2
G10    2
Name: Group, dtype: int64

In [91]:
df4.head()

           Tech1  Infra1  Energy1 Group  Defense1
Tata1        131     163      105    G5       193
Reliance1    192     117      174    G5       144
Wipro1       125     139      115   G10       154
Birla1       100     174      176    G5       137
Adani1       133     181      150   G20       136

#### Individual, Slice and Vector selection

In [90]:
# Slice based, no double [[]] required
df4.iloc[0:3]

           Tech1  Infra1  Energy1 Group  Defense1
Tata1        131     163      105    G5       193
Reliance1    192     117      174    G5       144
Wipro1       125     139      115   G10       154

In [92]:
df4.iloc[[1,3]]

           Tech1  Infra1  Energy1 Group  Defense1
Reliance1    192     117      174    G5       144
Birla1       100     174      176    G5       137

#### Mixing

In [94]:
df4.iloc[[2,3,5], 1:4:2]

            Infra1 Group
Wipro1         139   G10
Birla1         174    G5
Brittania1     105    G5

In [96]:
df4[1:2]

           Tech1  Infra1  Energy1 Group  Defense1
Reliance1    192     117      174    G5       144

In [102]:
df4.head()

           Tech1  Infra1  Energy1 Group  Defense1
Tata1        131     163      105    G5       193
Reliance1    192     117      174    G5       144
Wipro1       125     139      115   G10       154
Birla1       100     174      176    G5       137
Adani1       133     181      150   G20       136

In [97]:
df4.index

Index(['Tata1', 'Reliance1', 'Wipro1', 'Birla1', 'Adani1', 'Brittania1',
       'Unilever1', 'Mahindra1', 'Marico1'],
      dtype='object')

In [101]:
# df4.Tech1 
df4[["Tech1"]]

            Tech1
Tata1         131
Reliance1     192
Wipro1        125
Birla1        100
Adani1        133
Brittania1    166
Unilever1     192
Mahindra1     158
Marico1       174

In [104]:
df4.loc[['Tata1']]

       Tech1  Infra1  Energy1 Group  Defense1
Tata1    131     163      105    G5       193

In [105]:
df4.loc[['Reliance1', 'Wipro1']]

           Tech1  Infra1  Energy1 Group  Defense1
Reliance1    192     117      174    G5       144
Wipro1       125     139      115   G10       154

In [110]:
df4.index

Index(['Tata1', 'Reliance1', 'Wipro1', 'Birla1', 'Adani1', 'Brittania1',
       'Unilever1', 'Mahindra1', 'Marico1'],
      dtype='object')

In [116]:
df4.loc['Wipro1':'Brittania1', ['Group']]

           Group
Wipro1       G10
Birla1        G5
Adani1       G20
Brittania1    G5

In [118]:
df4.loc[::2, ['Group']]

          Group
Tata1        G5
Wipro1      G10
Adani1      G20
Unilever1    G5
Marico1     G20

### Conditional access

In [134]:
df5 = df4[df4.iloc[:,:3] > 150]

In [138]:
# df5
# df5.fillna(df5.mean())
df5.mean(axis=1)

Tata1         163.0
Reliance1     183.0
Wipro1          NaN
Birla1        175.0
Adani1        181.0
Brittania1    180.5
Unilever1     178.5
Mahindra1     160.5
Marico1       174.0
dtype: float64

### Sorting

In [140]:
df6 = df4.copy()

In [145]:
df6.head()

           Tech1  Infra1  Energy1 Group  Defense1
Tata1        131     163      105    G5       193
Reliance1    192     117      174    G5       144
Wipro1       125     139      115   G10       154
Birla1       100     174      176    G5       137
Adani1       133     181      150   G20       136

In [147]:
# df6.values
# df6.index
df6.columns

Index(['Tech1', 'Infra1', 'Energy1', 'Group', 'Defense1'], dtype='object')

In [158]:
print(df6.sort_index())

            Tech1  Infra1  Energy1 Group  Defense1
Adani1        133     181      150   G20       136
Birla1        100     174      176    G5       137
Brittania1    166     105      195    G5       119
Mahindra1     158     163      108   G10       165
Marico1       174     133      109   G20       130
Reliance1     192     117      174    G5       144
Tata1         131     163      105    G5       193
Unilever1     192     121      165    G5       115
Wipro1        125     139      115   G10       154

In [160]:
print(df6.sort_index(axis=1))

            Defense1  Energy1 Group  Infra1  Tech1
Tata1            193      105    G5     163    131
Reliance1        144      174    G5     117    192
Wipro1           154      115   G10     139    125
Birla1           137      176    G5     174    100
Adani1           136      150   G20     181    133
Brittania1       119      195    G5     105    166
Unilever1        115      165    G5     121    192
Mahindra1        165      108   G10     163    158
Marico1          130      109   G20     133    174

In [162]:
df6= df6.append([125,139,115,"G04",154])
df6

            Tech1  Infra1  Energy1 Group  Defense1
Tata1         131     163      105    G5       193
Reliance1     192     117      174    G5       144
Wipro1        125     139      115   G10       154
Birla1        100     174      176    G5       137
Adani1        133     181      150   G20       136
Brittania1    166     105      195    G5       119
Unilever1     192     121      165    G5       115
Mahindra1     158     163      108   G10       165
Marico1       174     133      109   G20       130

In [161]:
df6.sort_values(by='Group')

            Tech1  Infra1  Energy1 Group  Defense1
Wipro1        125     139      115   G10       154
Mahindra1     158     163      108   G10       165
Adani1        133     181      150   G20       136
Marico1       174     133      109   G20       130
Tata1         131     163      105    G5       193
Reliance1     192     117      174    G5       144
Birla1        100     174      176    G5       137
Brittania1    166     105      195    G5       119
Unilever1     192     121      165    G5       115

In [172]:
# Sort based on ASCII values
df6.sort_values(by='Group')

            Tech1  Infra1  Energy1 Group  Defense1
Wipro1        125     139      115   G10       154
Mahindra1     158     163      108   G10       165
Adani1        133     181      150   G20       136
Marico1       174     133      109   G20       130
Tata1         131     163      105    G5       193
Reliance1     192     117      174    G5       144
Birla1        100     174      176    G5       137
Brittania1    166     105      195    G5       119
Unilever1     192     121      165    G5       115

### Ranking

In [175]:
df7= pd.read_csv('profit.csv')
df7

            Tech1  Infra1  Energy1 Group  Defense1
Tata1         131     163      105    G5       193
Reliance1     192     117      174    G5       144
Wipro1        125     139      115   G10       144
Birla1        100     174      176    G5       137
Adani1        133     181      150   G20       136
Brittania1    166     105      195    G5       119
Unilever1     192     121      165    G5       115
Mahindra1     158     163      108   G10       115
Marico1       174     133      109   G20       130

In [187]:
df7['def_rank'] = df7['Defense1'].rank()
df7['def_rank_des'] = df7['Defense1'].rank(ascending=False) 
df7['def_rank_min'] = df7['Defense1'].rank(method="min")
df7['def_rank_first'] = df7['Defense1'].rank(method="first")
df7['def_rank_dense'] = df7['Defense1'].rank(method="dense")
df7['def_rank_max'] = df7['Defense1'].rank(method="max")

In [189]:
print(df7)

            Tech1  Infra1  Energy1 Group  Defense1  def_rank_des  def_rank  \
Tata1         131     163      105    G5       193           1.0       9.0
Reliance1     192     117      174    G5       144           2.5       7.5
Wipro1        125     139      115   G10       144           2.5       7.5
Birla1        100     174      176    G5       137           4.0       6.0
Adani1        133     181      150   G20       136           5.0       5.0
Brittania1    166     105      195    G5       119           7.0       3.0
Unilever1     192     121      165    G5       115           8.5       1.5
Mahindra1     158     163      108   G10       115           8.5       1.5
Marico1       174     133      109   G20       130           6.0       4.0

            def_rank_min  def_rank_first  def_rank_dense  def_rank_max
Tata1                9.0             9.0             7.0           9.0
Reliance1            7.0             7.0             6.0           8.0
Wipro1               7.0             8.0             6.0           8.0
Birla1               6.0             6.0             5.0           6.0
Adani1               5.0             5.0             4.0           5.0
Brittania1           3.0             3.0             2.0           3.0
Unilever1            1.0             1.0             1.0           2.0
Mahindra1            1.0             2.0             1.0           2.0
Marico1              4.0             4.0             3.0           4.0

In [202]:
df6['gdefense'] = df6.groupby('Group')['Defense1'].rank()
df6.sort_values(by='Group', inplace=True)
print(df6)

            Tech1  Infra1  Energy1 Group  Defense1  gdefense
Wipro1        125     139      115   G10       154       1.0
Mahindra1     158     163      108   G10       165       2.0
Marico1       174     133      109   G20       130       1.0
Adani1        133     181      150   G20       136       2.0
Unilever1     192     121      165    G5       115       1.0
Brittania1    166     105      195    G5       119       2.0
Birla1        100     174      176    G5       137       3.0
Reliance1     192     117      174    G5       144       4.0
Tata1         131     163      105    G5       193       5.0

In [205]:
df6['ggroup'] = df6.groupby('Group')['gdefense'].rank()
# df6.sort_values(by='Group', inplace=True)
print(df6)

            Tech1  Infra1  Energy1 Group  Defense1  gdefense  ggroup
Wipro1        125     139      115   G10       154       1.0     1.0
Mahindra1     158     163      108   G10       165       2.0     2.0
Marico1       174     133      109   G20       130       1.0     1.0
Adani1        133     181      150   G20       136       2.0     2.0
Unilever1     192     121      165    G5       115       1.0     1.0
Brittania1    166     105      195    G5       119       2.0     2.0
Birla1        100     174      176    G5       137       3.0     3.0
Reliance1     192     117      174    G5       144       4.0     4.0
Tata1         131     163      105    G5       193       5.0     5.0

### Stats intro

In [206]:
listdir()

['.ipynb_checkpoints', 'Day6.ipynb', 'mtcars.csv', 'profit.csv']

In [207]:
df = pd.read_csv('mtcars.csv')
df.head()

,model,mpg,cyl,disp,hp,drat,wt,qsec,vs,am,gear,carb
0,Mazda RX4,21.0,6,160.0,110,3.90,2.620,16.46,0,1,4,4
1,Mazda RX4 Wag,21.0,6,160.0,110,3.90,2.875,17.02,0,1,4,4
2,Datsun 710,22.8,4,108.0,93,3.85,2.320,18.61,1,1,4,1
3,Hornet 4 Drive,21.4,6,258.0,110,3.08,3.215,19.44,1,0,3,1
4,Hornet Sportabout,18.7,8,360.0,175,3.15,3.440,17.02,0,0,3,2

In [209]:
print(df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32 entries, 0 to 31
Data columns (total 12 columns):
model    32 non-null object
mpg      32 non-null float64
cyl      32 non-null int64
disp     32 non-null float64
hp       32 non-null int64
drat     32 non-null float64
wt       32 non-null float64
qsec     32 non-null float64
vs       32 non-null int64
am       32 non-null int64
gear     32 non-null int64
carb     32 non-null int64
dtypes: float64(5), int64(6), object(1)
memory usage: 2.9+ KB
None

In [211]:
df['hp'].max()

335

In [224]:
df['hp'].argmax()

c:\users\p s v\appdata\local\programs\python\python37-32\lib\site-packages\ipykernel_launcher.py:1: FutureWarning:
The current behaviour of 'Series.argmax' is deprecated, use 'idxmax'
instead.
The behavior of 'argmax' will be corrected to return the positional
maximum in the future. For now, use 'series.values.argmax' or
'np.argmax(np.array(values))' to get the position of the maximum
row.
  """Entry point for launching an IPython kernel.

30

In [215]:
df[df['hp'] == df['hp'].max()]

            model   mpg  cyl   disp   hp  drat    wt  qsec  vs  am  gear  carb
30  Maserati Bora  15.0    8  301.0  335  3.54  3.57  14.6   0   1     5     8

In [230]:
print(df[df['mpg'] == df['mpg'].max()].iloc[:,:3],'\n\n')
print(df[df['mpg'] == df['mpg'].min()].iloc[:,:3])

             model   mpg  cyl
19  Toyota Corolla  33.9    4


                  model   mpg  cyl
14   Cadillac Fleetwood  10.4    8
15  Lincoln Continental  10.4    8

In [253]:
df[df['mpg'] == df['mpg'].min()]

,model,mpg,cyl,disp,hp,drat,wt,qsec,vs,am,gear,carb
14,Cadillac Fleetwood,10.4,8,472.0,205,2.93,5.250,17.98,0,0,3,4
15,Lincoln Continental,10.4,8,460.0,215,3.00,5.424,17.82,0,0,3,4

In [265]:
df1 = df[df['mpg'] == df['mpg'].min()]
print(df1)
df1.loc[14]

                  model   mpg  cyl   disp   hp  drat     wt   qsec  vs  am  \
14   Cadillac Fleetwood  10.4    8  472.0  205  2.93  5.250  17.98   0   0
15  Lincoln Continental  10.4    8  460.0  215  3.00  5.424  17.82   0   0

    gear  carb
14     3     4
15     3     4

model    Cadillac Fleetwood
mpg                    10.4
cyl                       8
disp                    472
hp                      205
drat                   2.93
wt                     5.25
qsec                  17.98
vs                        0
am                        0
gear                      3
carb                      4
Name: 14, dtype: object

In [235]:
df['cyl'].value_counts()

8    14
4    11
6     7
Name: cyl, dtype: int64

In [243]:
print(df[df['cyl'] == 4]['model'].count())

11

In [246]:
df.columns

Index(['model', 'mpg', 'cyl', 'disp', 'hp', 'drat', 'wt', 'qsec', 'vs', 'am',
       'gear', 'carb'],
      dtype='object')

In [250]:
# 5 gears and mil > 15

print(df[(df['gear'] == 5) & (df['mpg'] > 15)])

,model,mpg,cyl,disp,hp,drat,wt,qsec,vs,am,gear,carb
26,Porsche 914-2,26.0,4,120.3,91,4.43,2.140,16.7,0,1,5,2
27,Lotus Europa,30.4,4,95.1,113,3.77,1.513,16.9,1,1,5,2
28,Ford Pantera L,15.8,8,351.0,264,4.22,3.170,14.5,0,1,5,4
29,Ferrari Dino,19.7,6,145.0,175,3.62,2.770,15.5,0,1,5,6